Autodesk.Revit.DB.Structure.StructuralSectionsServiceData.#ctor(Autodesk.Revit.DB.Document,System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementId})
Constructs a new instance of SectionTypeParameterServiceData.
document:
The current document.
currentElementIds:
The Ids of the current elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015